<!--
Copyright (c) Microsoft Corporation.  All rights reserved.
-->
<!--
Use of this source code is subject to the terms of the Microsoft
premium shared source license agreement under which you licensed
this source code. If you did not accept the terms of the license
agreement, you are not authorized to use this source code.
For the terms of the license, please see the license agreement
signed by you and Microsoft.
THE SOURCE CODE IS PROVIDED "AS IS", WITH NO WARRANTIES OR INDEMNITIES.
-->
<MgmtTree xmlns:MSFT="http://schemas.microsoft.com/MobileDevice/DM">
    <VerDTD>1.2</VerDTD>
    <Node>
        <NodeName>Proxy</NodeName>
        <Path>./Vendor/MSFT</Path>
        <DFProperties>
            <AccessType>
                <Get />
            </AccessType>
            <DFFormat>
                <node />
            </DFFormat>
            <Occurrence>
                <One />
            </Occurrence>
            <Scope>
                <Permanent />
            </Scope>
            <MSFT:RWAccess>3</MSFT:RWAccess>
            <MSFT:MinValue></MSFT:MinValue>
            <MSFT:MaxValue></MSFT:MaxValue>
            <MSFT:MaxLength></MSFT:MaxLength>
            <Description></Description>
        </DFProperties>
        <Node>
            <NodeName>*</NodeName>
            <DFProperties>
                <AccessType>
                    <Add />
                    <Get />
                    <Delete />
                </AccessType>
                <DFFormat>
                    <node />
                </DFFormat>
                <Occurrence>
                    <ZeroOrMore />
                </Occurrence>
                <Scope>
                    <Dynamic />
                </Scope>
                <MSFT:RWAccess>3</MSFT:RWAccess>
                <MSFT:MinValue></MSFT:MinValue>
                <MSFT:MaxValue></MSFT:MaxValue>
                <MSFT:MaxLength></MSFT:MaxLength>
                <Description>Need to specify all mandatory fields (fields whose occurrence is at least 1). The addition, update, and deletion of this sub-tree of nodes have to be specified in a single atomic transaction.</Description>
            </DFProperties>
            <Node>
                <NodeName>ProxyId</NodeName>
                <DFProperties>
                    <AccessType>
                        <Add />
                        <Get />
                        <Replace />
                    </AccessType>
                    <DFFormat>
                        <chr />
                    </DFFormat>
                    <Occurrence>
                        <One />
                    </Occurrence>
                    <Scope>
                        <Dynamic />
                    </Scope>
                    <MSFT:RWAccess>3</MSFT:RWAccess>
                    <DFType>
                        <MIME>text/plain</MIME>
                    </DFType>
                    <MSFT:MinValue></MSFT:MinValue>
                    <MSFT:MaxValue></MSFT:MaxValue>
                    <MSFT:MaxLength></MSFT:MaxLength>
                    <Description></Description>
                </DFProperties>
            </Node>
            <Node>
                <NodeName>Name</NodeName>
                <DFProperties>
                    <AccessType>
                        <Add />
                        <Get />
                        <Delete />
                        <Replace />
                    </AccessType>
                    <DFFormat>
                        <chr />
                    </DFFormat>
                    <Occurrence>
                        <ZeroOrOne />
                    </Occurrence>
                    <Scope>
                        <Dynamic />
                    </Scope>
                    <MSFT:RWAccess>3</MSFT:RWAccess>
                    <DFType>
                        <MIME>text/plain</MIME>
                    </DFType>
                    <MSFT:MinValue></MSFT:MinValue>
                    <MSFT:MaxValue></MSFT:MaxValue>
                    <MSFT:MaxLength></MSFT:MaxLength>
                    <Description></Description>
                </DFProperties>
            </Node>
            <Node>
                <NodeName>AddrType</NodeName>
                <DFProperties>
                    <AccessType>
                        <Add />
                        <Get />
                        <Replace />
                    </AccessType>
                    <DFFormat>
                        <chr />
                    </DFFormat>
                    <Occurrence>
                        <One />
                    </Occurrence>
                    <Scope>
                        <Dynamic />
                    </Scope>
                    <MSFT:RWAccess>3</MSFT:RWAccess>
                    <DFType>
                        <MIME>text/plain</MIME>
                    </DFType>
                    <MSFT:MinValue></MSFT:MinValue>
                    <MSFT:MaxValue></MSFT:MaxValue>
                    <MSFT:MaxLength></MSFT:MaxLength>
                    <Description>one of IPV4,IPV6,E164,ALPHA</Description>
                </DFProperties>
            </Node>
            <Node>
                <NodeName>Addr</NodeName>
                <DFProperties>
                    <AccessType>
                        <Add />
                        <Get />
                        <Replace />
                    </AccessType>
                    <DFFormat>
                        <chr />
                    </DFFormat>
                    <Occurrence>
                        <One />
                    </Occurrence>
                    <Scope>
                        <Dynamic />
                    </Scope>
                    <MSFT:RWAccess>3</MSFT:RWAccess>
                    <DFType>
                        <MIME>text/plain</MIME>
                    </DFType>
                    <MSFT:MinValue></MSFT:MinValue>
                    <MSFT:MaxValue></MSFT:MaxValue>
                    <MSFT:MaxLength></MSFT:MaxLength>
                    <Description></Description>
                </DFProperties>
            </Node>
            <Node>
                <NodeName>AddrFQDN</NodeName>
                <DFProperties>
                    <AccessType>
                        <Add />
                        <Get />
                        <Delete />
                        <Replace />
                    </AccessType>
                    <DFFormat>
                        <chr />
                    </DFFormat>
                    <Occurrence>
                        <ZeroOrOne />
                    </Occurrence>
                    <Scope>
                        <Dynamic />
                    </Scope>
                    <MSFT:RWAccess>3</MSFT:RWAccess>
                    <DFType>
                        <MIME>text/plain</MIME>
                    </DFType>
                    <MSFT:MinValue></MSFT:MinValue>
                    <MSFT:MaxValue></MSFT:MaxValue>
                    <MSFT:MaxLength></MSFT:MaxLength>
                    <Description></Description>
                </DFProperties>
            </Node>
            <Node>
                <NodeName>ConRefs</NodeName>
                <DFProperties>
                    <AccessType>
                        <Add />
                        <Get />
                        <Delete />
                    </AccessType>
                    <DFFormat>
                        <node />
                    </DFFormat>
                    <Occurrence>
                        <ZeroOrOne />
                    </Occurrence>
                    <Scope>
                        <Dynamic />
                    </Scope>
                    <MSFT:RWAccess>3</MSFT:RWAccess>
                    <DFType>
                        <MIME>text/plain</MIME>
                    </DFType>
                    <MSFT:MinValue></MSFT:MinValue>
                    <MSFT:MaxValue></MSFT:MaxValue>
                    <MSFT:MaxLength></MSFT:MaxLength>
                    <Description></Description>
                </DFProperties>
                <Node>
                    <NodeName>*</NodeName>
                    <DFProperties>
                        <AccessType>
                            <Add />
                            <Get />
                            <Delete />
                        </AccessType>
                        <DFFormat>
                            <node />
                        </DFFormat>
                        <Occurrence>
                            <OneOrMore />
                        </Occurrence>
                        <Scope>
                            <Dynamic />
                        </Scope>
                        <MSFT:RWAccess>3</MSFT:RWAccess>
                        <DFType>
                            <MIME>text/plain</MIME>
                        </DFType>
                        <MSFT:MinValue></MSFT:MinValue>
                        <MSFT:MaxValue></MSFT:MaxValue>
                        <MSFT:MaxLength></MSFT:MaxLength>
                        <Description></Description>
                    </DFProperties>
                    <Node>
                        <NodeName>ConRef</NodeName>
                        <DFProperties>
                            <AccessType>
                                <Add />
                                <Get />
                                <Replace />
                            </AccessType>
                            <DFFormat>
                                <chr />
                            </DFFormat>
                            <Occurrence>
                                <One />
                            </Occurrence>
                            <Scope>
                                <Dynamic />
                            </Scope>
                            <MSFT:RWAccess>3</MSFT:RWAccess>
                            <DFType>
                                <MIME>text/plain</MIME>
                            </DFType>
                            <MSFT:MinValue></MSFT:MinValue>
                            <MSFT:MaxValue></MSFT:MaxValue>
                            <MSFT:MaxLength></MSFT:MaxLength>
                            <Description></Description>
                        </DFProperties>
                    </Node>
                </Node>
            </Node>
            <Node>
                <NodeName>Domains</NodeName>
                <DFProperties>
                    <AccessType>
                        <Add />
                        <Get />
                        <Delete />
                    </AccessType>
                    <DFFormat>
                        <node />
                    </DFFormat>
                    <Occurrence>
                        <ZeroOrOne />
                    </Occurrence>
                    <Scope>
                        <Dynamic />
                    </Scope>
                    <MSFT:RWAccess>3</MSFT:RWAccess>
                    <MSFT:MinValue></MSFT:MinValue>
                    <MSFT:MaxValue></MSFT:MaxValue>
                    <MSFT:MaxLength></MSFT:MaxLength>
                    <Description></Description>
                </DFProperties>
                <Node>
                    <NodeName>*</NodeName>
                    <DFProperties>
                        <AccessType>
                            <Add />
                            <Get />
                            <Delete />
                        </AccessType>
                        <DFFormat>
                            <node />
                        </DFFormat>
                        <Occurrence>
                            <OneOrMore />
                        </Occurrence>
                        <Scope>
                            <Dynamic />
                        </Scope>
                        <MSFT:RWAccess>3</MSFT:RWAccess>
                        <MSFT:MinValue></MSFT:MinValue>
                        <MSFT:MaxValue></MSFT:MaxValue>
                        <MSFT:MaxLength></MSFT:MaxLength>
                        <Description></Description>
                    </DFProperties>
                    <Node>
                        <NodeName>DomainName</NodeName>
                        <DFProperties>
                            <AccessType>
                                <Add />
                                <Get />
                                <Replace />
                            </AccessType>
                            <DFFormat>
                                <chr />
                            </DFFormat>
                            <Occurrence>
                                <One />
                            </Occurrence>
                            <Scope>
                                <Dynamic />
                            </Scope>
                            <MSFT:RWAccess>3</MSFT:RWAccess>
                            <DFType>
                                <MIME>text/plain</MIME>
                            </DFType>
                            <MSFT:MinValue></MSFT:MinValue>
                            <MSFT:MaxValue></MSFT:MaxValue>
                            <MSFT:MaxLength></MSFT:MaxLength>
                            <Description></Description>
                        </DFProperties>
                    </Node>
                </Node>
            </Node>
            <Node>
                <NodeName>Ports</NodeName>
                <DFProperties>
                    <AccessType>
                        <Add />
                        <Get />
                        <Delete />
                    </AccessType>
                    <DFFormat>
                        <node />
                    </DFFormat>
                    <Occurrence>
                        <ZeroOrOne />
                    </Occurrence>
                    <Scope>
                        <Dynamic />
                    </Scope>
                    <MSFT:RWAccess>3</MSFT:RWAccess>
                    <MSFT:MinValue></MSFT:MinValue>
                    <MSFT:MaxValue></MSFT:MaxValue>
                    <MSFT:MaxLength></MSFT:MaxLength>
                    <Description></Description>
                </DFProperties>
                <Node>
                    <NodeName>*</NodeName>
                    <DFProperties>
                        <AccessType>
                            <Add />
                            <Get />
                            <Delete />
                        </AccessType>
                        <DFFormat>
                            <node />
                        </DFFormat>
                        <Occurrence>
                            <OneOrMore />
                        </Occurrence>
                        <Scope>
                            <Dynamic />
                        </Scope>
                        <MSFT:RWAccess>3</MSFT:RWAccess>
                        <MSFT:MinValue></MSFT:MinValue>
                        <MSFT:MaxValue></MSFT:MaxValue>
                        <MSFT:MaxLength></MSFT:MaxLength>
                        <Description></Description>
                    </DFProperties>
                    <Node>
                        <NodeName>PortNbr</NodeName>
                        <DFProperties>
                            <AccessType>
                                <Add />
                                <Get />
                                <Replace />
                            </AccessType>
                            <DFFormat>
                                <int />
                            </DFFormat>
                            <Occurrence>
                                <One />
                            </Occurrence>
                            <Scope>
                                <Dynamic />
                            </Scope>
                            <MSFT:RWAccess>3</MSFT:RWAccess>
                            <DFType>
                                <MIME>text/plain</MIME>
                            </DFType>
                            <MSFT:MinValue>0</MSFT:MinValue>
                            <MSFT:MaxValue>65535</MSFT:MaxValue>
                            <MSFT:MaxLength></MSFT:MaxLength>
                            <Description></Description>
                        </DFProperties>
                    </Node>
                    <Node>
                        <NodeName>Services</NodeName>
                        <DFProperties>
                            <AccessType>
                                <Add />
                                <Get />
                                <Delete />
                            </AccessType>
                            <DFFormat>
                                <node />
                            </DFFormat>
                            <Occurrence>
                                <ZeroOrOne />
                            </Occurrence>
                            <Scope>
                                <Dynamic />
                            </Scope>
                            <MSFT:RWAccess>3</MSFT:RWAccess>
                            <MSFT:MinValue></MSFT:MinValue>
                            <MSFT:MaxValue></MSFT:MaxValue>
                            <MSFT:MaxLength></MSFT:MaxLength>
                            <Description></Description>
                        </DFProperties>
                        <Node>
                            <NodeName>*</NodeName>
                            <DFProperties>
                                <AccessType>
                                    <Add />
                                    <Get />
                                    <Delete />
                                </AccessType>
                                <DFFormat>
                                    <node />
                                </DFFormat>
                                <Occurrence>
                                    <OneOrMore />
                                </Occurrence>
                                <Scope>
                                    <Dynamic />
                                </Scope>
                                <MSFT:RWAccess>3</MSFT:RWAccess>
                                <MSFT:MinValue></MSFT:MinValue>
                                <MSFT:MaxValue></MSFT:MaxValue>
                                <MSFT:MaxLength></MSFT:MaxLength>
                                <Description></Description>
                            </DFProperties>
                            <Node>
                                <NodeName>ServiceName</NodeName>
                                <DFProperties>
                                    <AccessType>
                                        <Add />
                                        <Get />
                                        <Replace />
                                    </AccessType>
                                    <DFFormat>
                                        <chr />
                                    </DFFormat>
                                    <Occurrence>
                                        <One />
                                    </Occurrence>
                                    <Scope>
                                        <Dynamic />
                                    </Scope>
                                    <MSFT:RWAccess>3</MSFT:RWAccess>
                                    <DFType>
                                        <MIME>text/plain</MIME>
                                    </DFType>
                                    <MSFT:MinValue></MSFT:MinValue>
                                    <MSFT:MaxValue></MSFT:MaxValue>
                                    <MSFT:MaxLength></MSFT:MaxLength>
                                    <Description></Description>
                                </DFProperties>
                            </Node>
                        </Node>
                    </Node>
                </Node>
            </Node>
            <Node>
                <NodeName>ProxyType</NodeName>
                <DFProperties>
                    <AccessType>
                        <Add />
                        <Get />
                        <Replace />
                    </AccessType>
                    <DFFormat>
                        <chr />
                    </DFFormat>
                    <Occurrence>
                        <One />
                    </Occurrence>
                    <Scope>
                        <Dynamic />
                    </Scope>
                    <MSFT:RWAccess>3</MSFT:RWAccess>
                    <DFType>
                        <MIME>text/plain</MIME>
                    </DFType>
                    <MSFT:MinValue></MSFT:MinValue>
                    <MSFT:MaxValue></MSFT:MaxValue>
                    <MSFT:MaxLength></MSFT:MaxLength>
                    <Description>one of WAP,SOCKS,ISA,NULL</Description>
                </DFProperties>
            </Node>
            <Node>
                <NodeName>ProxyParams</NodeName>
                <DFProperties>
                    <AccessType>
                        <Add />
                        <Get />
                        <Delete />
                    </AccessType>
                    <DFFormat>
                        <node />
                    </DFFormat>
                    <Occurrence>
                        <ZeroOrOne />
                    </Occurrence>
                    <Scope>
                        <Dynamic />
                    </Scope>
                    <MSFT:RWAccess>3</MSFT:RWAccess>
                    <MSFT:MinValue></MSFT:MinValue>
                    <MSFT:MaxValue></MSFT:MaxValue>
                    <MSFT:MaxLength></MSFT:MaxLength>
                    <Description></Description>
                </DFProperties>
                <Node>
                    <NodeName>WAP</NodeName>
                    <DFProperties>
                        <AccessType>
                            <Add />
                            <Get />
                            <Delete />
                        </AccessType>
                        <DFFormat>
                            <node />
                        </DFFormat>
                        <Occurrence>
                            <ZeroOrOne />
                        </Occurrence>
                        <Scope>
                            <Dynamic />
                        </Scope>
                        <MSFT:RWAccess>3</MSFT:RWAccess>
                        <MSFT:MinValue></MSFT:MinValue>
                        <MSFT:MaxValue></MSFT:MaxValue>
                        <MSFT:MaxLength></MSFT:MaxLength>
                        <Description>applicable only if ProxyType is set to "WAP".</Description>
                    </DFProperties>
                    <Node>
                        <NodeName>Trust</NodeName>
                        <DFProperties>
                            <AccessType>
                                <Add />
                                <Get />
                                <Delete />
                                <Replace />
                            </AccessType>
                            <DFFormat>
                                <bool />
                            </DFFormat>
                            <Occurrence>
                                <ZeroOrOne />
                            </Occurrence>
                            <Scope>
                                <Dynamic />
                            </Scope>
                            <MSFT:RWAccess>3</MSFT:RWAccess>
                            <DFType>
                                <MIME>text/plain</MIME>
                            </DFType>
                            <MSFT:MinValue></MSFT:MinValue>
                            <MSFT:MaxValue></MSFT:MaxValue>
                            <MSFT:MaxLength></MSFT:MaxLength>
                            <Description></Description>
                        </DFProperties>
                    </Node>
                    <Node>
                        <NodeName>PushEnabled</NodeName>
                        <DFProperties>
                            <AccessType>
                                <Add />
                                <Get />
                                <Delete />
                                <Replace />
                            </AccessType>
                            <DFFormat>
                                <bool />
                            </DFFormat>
                            <Occurrence>
                                <ZeroOrOne />
                            </Occurrence>
                            <Scope>
                                <Dynamic />
                            </Scope>
                            <MSFT:RWAccess>3</MSFT:RWAccess>
                            <DFType>
                                <MIME>text/plain</MIME>
                            </DFType>
                            <MSFT:MinValue></MSFT:MinValue>
                            <MSFT:MaxValue></MSFT:MaxValue>
                            <MSFT:MaxLength></MSFT:MaxLength>
                            <Description>TRUE if it is a push proxy gateway entry; otherwise, assumed to be FALSE.</Description>
                        </DFProperties>
                    </Node>
                </Node>
            </Node>
            <Node>
                <NodeName>Ext</NodeName>
                <DFProperties>
                    <AccessType>
                        <Get />
                    </AccessType>
                    <DFFormat>
                        <node />
                    </DFFormat>
                    <Occurrence>
                        <ZeroOrOne />
                    </Occurrence>
                    <Scope>
                        <Dynamic />
                    </Scope>
                    <MSFT:RWAccess>1</MSFT:RWAccess>
                    <MSFT:MinValue></MSFT:MinValue>
                    <MSFT:MaxValue></MSFT:MaxValue>
                    <MSFT:MaxLength></MSFT:MaxLength>
                    <Description></Description>
                </DFProperties>
                <Node>
                    <NodeName>Microsoft</NodeName>
                    <DFProperties>
                        <AccessType>
                            <Get />
                        </AccessType>
                        <DFFormat>
                            <node />
                        </DFFormat>
                        <Occurrence>
                            <One />
                        </Occurrence>
                        <Scope>
                            <Dynamic />
                        </Scope>
                        <MSFT:RWAccess>1</MSFT:RWAccess>
                        <MSFT:MinValue></MSFT:MinValue>
                        <MSFT:MaxValue></MSFT:MaxValue>
                        <MSFT:MaxLength></MSFT:MaxLength>
                        <Description></Description>
                    </DFProperties>
                    <Node>
                        <NodeName>Guid</NodeName>
                        <DFProperties>
                            <AccessType>
                                <Get />
                            </AccessType>
                            <DFFormat>
                                <chr />
                            </DFFormat>
                            <Occurrence>
                                <One />
                            </Occurrence>
                            <Scope>
                                <Dynamic />
                            </Scope>
                            <MSFT:RWAccess>1</MSFT:RWAccess>
                            <DFType>
                                <MIME>text/plain</MIME>
                            </DFType>
                            <MSFT:MinValue></MSFT:MinValue>
                            <MSFT:MaxValue></MSFT:MaxValue>
                            <MSFT:MaxLength></MSFT:MaxLength>
                            <Description></Description>
                        </DFProperties>
                    </Node>
                </Node>
            </Node>
        </Node>
    </Node>
</MgmtTree>
